bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/XMEGA/ATXMEGA256A3B.xml
                    </instance>
                </module>
                <module name="MCU" id="I6091">
                    <instance name="MCU">
                        <register-group address-space="data" offset="0x0090" name-in-module="MCU" name="MCU"/>
                    </instance>
                </module>
                <module name="PMIC" id="I6057">
                    <instance name="PMIC">
                        <register-group address-space="data" offset="0x00A0" name-in-module="PMIC" name="PMIC"/>
                    </instance>
                </module>
                <module name="DMA" id="I3000">
                    <instance name="DMA">
                        <register-group address-space="data" offset="0x0100" name-in-module="DMA" name="DMA"/>
                    </instance>
                </module>
                <module name="EVSYS" id="I6061">
                    <instance name="EVSYS">
                        <register-group address-space="data" offset="0x0180" name-in-module="EVSYS" name="EVSYS"/>
                    </instance>
                </module>
                <module name="NVM" id="I6076">
                    <instance name="NVM">
                        <register-group address-space="data" offset="0x01C0" name-in-module="NVM" name="NVM"/>
                    </instance>
                    <instance name="FUSE">
                        <register-group address-space="fuses" offset="0x00" name-in-module="NVM_FUSES" name="FUSE"/>
                    </instance>
                    <instance name="LOCKBIT">
                        <register-group address-space="lockbits" offset="0x00" name-in-module="NVM_LOCKBITS"
                                        name="LOCKBIT"/>
                    </instance>
                    <instance name="PROD_SIGNATURES">
                        <register-group address-space="prod_signatures" offset="0x00"
                                        name-in-module="NVM_PROD_SIGNATURES" name="PROD_SIGNATURES"/>
                    </instance>
                </module>
                <module name="AC" id="I6077">
                    <instance name="ACA">
                        <register-group address-space="data" offset="0x0380" name-in-module="AC" name="ACA"/>
                    </instance>
                    <instance name="ACB">
                        <register-group address-space="data" offset="0x0390" name-in-module="AC" name="ACB"/>
                    </instance>
                </module>
                <module name="ADC" id="I6064">
                    <instance name="ADCA">
                        <register-group address-space="data" offset="0x0200" name-in-module="ADC" name="ADCA"/>
                    </instance>
                    <instance name="ADCB">
                        <register-group address-space="data" offset="0x0240" name-in-module="ADC" name="ADCB"/>
                    </instance>
                </module>
                <module name="DAC" id="I6059">
                    <instance name="DACB">
                        <register-group address-space="data" offset="0x0320" name-in-module="DAC" name="DACB"/>
                    </instance>
                </module>
                <module name="RTC32" id="I6106">
                    <instance name="RTC32">
                        <register-group address-space="data" offset="0x0420" name-in-module="RTC32" name="RTC32"/>
                    </instance>
                </module>
                <module name="TWI" id="I6089">
                    <instance name="TWIC">
                        <register-group address-space="data" offset="0x480" name-in-module="TWI" name="TWIC"/>
                    </instance>
                    <instance name="TWIE">
                        <register-group address-space="data" offset="0x4A0" name-in-module="TWI" name="TWIE"/>
                    </instance>
                </module>
                <module name="PORT" id="I6075">
                    <instance name="PORT_CFG">
                        <register-group address-space="data" offset="0x00B0" name-in-module="PORTCFG" name="PORTCFG"/>
                    </instance>
                    <instance name="VPORT0">
                        <register-group address-space="data" offset="0x0010" name-in-module="VPORT" name="VPORT0"/>
                    </instance>
                    <instance name="VPORT1">
                        <register-group address-space="data" offset="0x0014" name-in-module="VPORT" name="VPORT1"/>
                    </instance>
                    <instance name="VPORT2">
                        <register-group address-space="data" offset="0x0018" name-in-module="VPORT" name="VPORT2"/>
                    </instance>
                    <instance name="VPORT3">
                        <register-group address-space="data" offset="0x001C" name-in-module="VPORT" name="VPORT3"/>
                    </instance>
                    <instance name="PORTA">
                        <register-group address-space="data" offset="0x0600" name-in-module="PORT" name="PORTA"/>
                    </instance>
                    <instance name="PORTB">
                        <register-group address-space="data" offset="0x0620" name-in-module="PORT" name="PORTB"/>
                    </instance>
                    <instance name="PORTC">
                        <register-group address-space="data" offset="0x0640" name-in-module="PORT" name="PORTC"/>
                    </instance>
                    <instance name="PORTD">
                        <register-group address-space="data" offset="0x0660" name-in-module="PORT" name="PORTD"/>
                    </instance>
                    <instance name="PORTE">
                        <register-group address-space="data" offset="0x0680" name-in-module="PORT" name="PORTE"/>
                    </instance>
                    <instance name="PORTF">
                        <register-group address-space="data" offset="0x06A0" name-in-module="PORT" name="PORTF"/>
