bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/XMEGA/ATXMEGA256A3B.xml
            <value-group caption="Event action selection" name="ADC_EVACT">
                <value caption="No event action" name="NONE" value="0x00"/>
                <value caption="First event triggers channel 0" name="CH0" value="0x01"/>
                <value caption="First two events trigger channel 0,1" name="CH01" value="0x02"/>
                <value caption="First three events trigger channel 0,1,2" name="CH012" value="0x03"/>
                <value caption="Events trigger channel 0,1,2,3" name="CH0123" value="0x04"/>
                <value caption="First event triggers sweep" name="SWEEP" value="0x05"/>
                <value caption="The ADC is flushed and restarted for accurate timing" name="SYNCSWEEP" value="0x06"/>
            </value-group>
            <value-group caption="Interrupt mode" name="ADC_CH_INTMODE">
                <value caption="Interrupt on conversion complete" name="COMPLETE" value="0x00"/>
                <value caption="Interrupt on result below compare value" name="BELOW" value="0x01"/>
                <value caption="Interrupt on result above compare value" name="ABOVE" value="0x03"/>
            </value-group>
            <value-group caption="Interrupt level" name="ADC_CH_INTLVL">
                <value caption="Interrupt disabled" name="OFF" value="0x00"/>
                <value caption="Low level" name="LO" value="0x01"/>
                <value caption="Medium level" name="MED" value="0x02"/>
                <value caption="High level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="DMA request selection" name="ADC_DMASEL">
                <value caption="Combined DMA request OFF" name="OFF" value="0x00"/>
                <value caption="ADC Channel 0 or 1" name="CH01" value="0x01"/>
                <value caption="ADC Channel 0 or 1 or 2" name="CH012" value="0x02"/>
                <value caption="ADC Channel 0 or 1 or 2 or 3" name="CH0123" value="0x03"/>
            </value-group>
            <value-group caption="Clock prescaler" name="ADC_PRESCALER">
                <value caption="Divide clock by 4" name="DIV4" value="0x00"/>
                <value caption="Divide clock by 8" name="DIV8" value="0x01"/>
                <value caption="Divide clock by 16" name="DIV16" value="0x02"/>
                <value caption="Divide clock by 32" name="DIV32" value="0x03"/>
                <value caption="Divide clock by 64" name="DIV64" value="0x04"/>
                <value caption="Divide clock by 128" name="DIV128" value="0x05"/>
                <value caption="Divide clock by 256" name="DIV256" value="0x06"/>
                <value caption="Divide clock by 512" name="DIV512" value="0x07"/>
            </value-group>
            <interrupt-group name="ADC">
                <interrupt index="0" name="CH0" caption="Interrupt 0"/>
                <interrupt index="1" name="CH1" caption="Interrupt 1"/>
                <interrupt index="2" name="CH2" caption="Interrupt 2"/>
                <interrupt index="3" name="CH3" caption="Interrupt 3"/>
            </interrupt-group>
        </module>
        <module name="DAC" id="I6059" caption="Digital/Analog Converter">
            <register-group caption="Digital-to-Analog Converter" name="DAC" size="28">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Internal Output Enable" mask="0x10" name="IDOEN"/>
                    <bitfield caption="Channel 1 Output Enable" mask="0x08" name="CH1EN"/>
                    <bitfield caption="Channel 0 Output Enable" mask="0x04" name="CH0EN"/>
                    <bitfield caption="Low Power Mode" mask="0x02" name="LPMODE"/>
                    <bitfield caption="Enable" mask="0x01" name="ENABLE"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Channel Select" mask="0x60" name="CHSEL" values="DAC_CHSEL"/>
                    <bitfield caption="Channel 1 Event Trig Enable" mask="0x02" name="CH1TRIG"/>
                    <bitfield caption="Channel 0 Event Trig Enable" mask="0x01" name="CH0TRIG"/>
                </register>
                <register caption="Control Register C" name="CTRLC" offset="0x02" size="1">
                    <bitfield caption="Reference Select" mask="0x18" name="REFSEL" values="DAC_REFSEL"/>
                    <bitfield caption="Left-adjust Result" mask="0x01" name="LEFTADJ"/>
                </register>
                <register caption="Event Input Control" name="EVCTRL" offset="0x03" size="1">
                    <bitfield caption="Event Input Selection" mask="0x07" name="EVSEL" values="DAC_EVSEL"/>
                </register>
                <register caption="Timing Control" name="TIMCTRL" offset="0x04" size="1">
                    <bitfield caption="Conversion Intercal" mask="0x70" name="CONINTVAL" values="DAC_CONINTVAL"/>
                    <bitfield caption="Refresh Timing Control" mask="0x0F" name="REFRESH" values="DAC_REFRESH"/>
                </register>
                <register caption="Status" name="STATUS" offset="0x05" size="1">
                    <bitfield caption="Channel 1 Data Register Empty" mask="0x02" name="CH1DRE"/>
                    <bitfield caption="Channel 0 Data Register Empty" mask="0x01" name="CH0DRE"/>
                </register>
                <register caption="Gain Calibration" name="GAINCAL" offset="0x08" size="1">
                    <bitfield caption="Gain Calibration" mask="0x7F" name="GAINCAL"/>
                </register>
                <register caption="Offset Calibration" name="OFFSETCAL" offset="0x09" size="1">
                    <bitfield caption="Offset Calibration" mask="0x7F" name="OFFSETCAL"/>
                </register>
                <register caption="Channel 0 Data" name="CH0DATA" offset="0x18" size="2"/>
                <register caption="Channel 1 Data" name="CH1DATA" offset="0x1A" size="2"/>
            </register-group>
            <value-group caption="Output channel selection" name="DAC_CHSEL">
                <value caption="Single channel operation (Channel A only)" name="SINGLE" value="0x00"/>
                <value caption="Dual channel operation (S/H on both channels)" name="DUAL" value="0x02"/>
            </value-group>
            <value-group caption="Reference voltage selection" name="DAC_REFSEL">
                <value caption="Internal 1V " name="INT1V" value="0x00"/>
                <value caption="Analog supply voltage" name="AVCC" value="0x01"/>
                <value caption="External reference on AREF on PORTA" name="AREFA" value="0x02"/>
                <value caption="External reference on AREF on PORTB" name="AREFB" value="0x03"/>
            </value-group>
