bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/XMEGA/ATXMEGA256A3B.xml
            <value-group caption="SPI Mode" name="SPI_MODE">
                <value caption="SPI Mode 0" name="0" value="0x00"/>
                <value caption="SPI Mode 1" name="1" value="0x01"/>
                <value caption="SPI Mode 2" name="2" value="0x02"/>
                <value caption="SPI Mode 3" name="3" value="0x03"/>
            </value-group>
            <value-group caption="Prescaler setting" name="SPI_PRESCALER">
                <value caption="System Clock / 4" name="DIV4" value="0x00"/>
                <value caption="System Clock / 16" name="DIV16" value="0x01"/>
                <value caption="System Clock / 64" name="DIV64" value="0x02"/>
                <value caption="System Clock / 128" name="DIV128" value="0x03"/>
            </value-group>
            <value-group caption="Interrupt level" name="SPI_INTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="SPI">
                <interrupt index="0" name="INT" caption="SPI Interrupt"/>
            </interrupt-group>
        </module>
        <module name="IRCOM" id="I6090" caption="IR Communication Module">
            <register-group caption="IR Communication Module" name="IRCOM" size="3">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Event Channel Select" mask="0x0F" name="EVSEL" values="IRDA_EVSEL"/>
                </register>
                <register caption="IrDA Transmitter Pulse Length Control Register" name="TXPLCTRL" offset="0x01"
                          size="1"/>
                <register caption="IrDA Receiver Pulse Length Control Register" name="RXPLCTRL" offset="0x02" size="1"/>
            </register-group>
            <value-group caption="Event channel selection" name="IRDA_EVSEL">
                <value caption="No Event Source" name="OFF" value="0x00"/>
                <value caption="Event Channel 0" name="0" value="0x08"/>
                <value caption="Event Channel 1" name="1" value="0x09"/>
                <value caption="Event Channel 2" name="2" value="0x0A"/>
                <value caption="Event Channel 3" name="3" value="0x0B"/>
                <value caption="Event Channel 4" name="4" value="0x0C"/>
                <value caption="Event Channel 5" name="5" value="0x0D"/>
                <value caption="Event Channel 6" name="6" value="0x0E"/>
                <value caption="Event Channel 7" name="7" value="0x0F"/>
            </value-group>
        </module>
        <module name="AES" id="I6096" caption="AES Module">
            <register-group caption="AES Module" name="AES" size="5">
                <register caption="AES Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Start/Run" mask="0x80" name="START"/>
                    <bitfield caption="Auto Start Trigger" mask="0x40" name="AUTO"/>
                    <bitfield caption="AES Software Reset" mask="0x20" name="RESET"/>
                    <bitfield caption="Decryption / Direction" mask="0x10" name="DECRYPT"/>
                    <bitfield caption="State XOR Load Enable" mask="0x04" name="XOR"/>
                </register>
                <register caption="AES Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="AES Error" mask="0x80" name="ERROR"/>
                    <bitfield caption="State Ready Interrupt Flag" mask="0x01" name="SRIF"/>
                </register>
                <register caption="AES State Register" name="STATE" offset="0x02" size="1"/>
                <register caption="AES Key Register" name="KEY" offset="0x03" size="1"/>
                <register caption="AES Interrupt Control Register" name="INTCTRL" offset="0x04" size="1">
                    <bitfield caption="Interrupt level" mask="0x03" name="INTLVL" values="AES_INTLVL"/>
                </register>
            </register-group>
            <value-group caption="Interrupt level" name="AES_INTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="AES">
                <interrupt index="0" name="INT" caption="AES Interrupt"/>
            </interrupt-group>
        </module>
        <module name="VBAT" id="I6107" caption="Battery Backup Module">
            <register-group caption="Battery Backup Module" name="VBAT" size="4">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="32-kHz Crystal Oscillator High Power Mode" mask="0x20" name="HIGHESR"/>
                    <bitfield caption="32-kHz Crystal Oscillator Output Selection" mask="0x10" name="XOSCSEL"/>
                    <bitfield caption="Crystal Oscillator Enable" mask="0x08" name="XOSCEN"/>
                    <bitfield caption="Crystal Oscillator Failure Detection Monitor Enable" mask="0x04"
                              name="XOSCFDEN"/>
                    <bitfield caption="Access Enable" mask="0x02" name="ACCEN"/>
                    <bitfield caption="Reset" mask="0x01" name="RESET"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="Battery backup Power" mask="0x80" name="BBPWR"/>
                    <bitfield caption="Crystal Oscillator Ready" mask="0x08" name="XOSCRDY"/>
                    <bitfield caption="Crystal Oscillator Failure" mask="0x04" name="XOSCFAIL"/>
                    <bitfield caption="Battery Backup Brown-Out Reset Flag" mask="0x02" name="BBBORF"/>
                    <bitfield caption="Battery Backup Power-On Reset Flag" mask="0x01" name="BBPORF"/>
                </register>
                <register caption="Backup Register 0" name="BACKUP0" offset="0x02" size="1"/>
                <register caption="Backup Register 1" name="BACKUP1" offset="0x03" size="1"/>
            </register-group>
        </module>
    </modules>
</part-description-file>